# План тестирования

### Содержание

1.  Введение
    
2.  Объект тестирования
    
3.  Риски
    
4.  Аспекты тестирования

5.  Подходы к тестированию

6.  Представление результатов
    
7.  Выводы
    

## 1. Введение

Данный документ подготовлен с целью проведения тестирования программного продукта SEFOLL. Тестирования будет выполняться в соответствии с требованиями, описанными в [SRS](https://github.com/Alex-Sidorov/SEFOLL/blob/master/documents/srs.md).

## 2. Объект тестирования



## 3. Риски

Риски при использовании приложения:

-   Отсутствие необходимых динамических библиотек для корректной работы приложения.
-   Отсутствие места на жёстком диске для хранение динамических библиотек.

## 4. Аспекты тестирования

#### Тестирование будет являться:
- по объекту тестирования: функциональности, безопасности.
- по знанию системы: тестирование чёрного ящика.
- по степени изолированности: модульное.
- по степени автоматизации: ручное.
- по позитивности сценария: позитивным, негативным.
- по важности: расширенное.

#### Тестируемые  функции, заявленные в SRS:  

1. Разделение уровней доступа
2. Авторизация в системе 
3.  Выход из системы    
4.  Добавления новой услуги в список услуг  
5.  Удаление услуг из списка услуг
6.  Редактирование услуг в списке услуг
7.  Оформление заказа  
8.  Просмотр заказа   
9.  Подтверждение выполнения заказа
10.  Добавление пользователя в проект с назначением ему роли  
11. Просмотр статистики о выполненных заказах 
12.  Внесение паролей в базу   
13.  Удаление паролей из базы
14.  Изменение уровней доступа
15.  Сохранения всех заказов в базе
16.  Сохранения всех услуг в базе 
17.  Сохранение всех паролей в базе  

#### Тестируемые  нефункциональные требования:
1. Интерфейс всех окон должен быть выполнен в одной цветовой гамме.
2.  Окна должны очищаться при их закрытии.
3.  В любой момент должно быть активно только одно окно.
4.   Все ошибки должны сопровождаться поясняющими сообщениями.

## 5. Подходы к тестированию


## 6. Представление результатов


## 7. Выводы
